package com.study.tedkim.actionbar_hiding;

/**
 * Created by tedkim on 2017. 3. 22..
 */

public class PlanetInfo {
    public static String P_NAME = "지구";
    public static String P_DESC = "우리가 살고 있는 푸른 행성이 바로 지구이다. 우주에서 봤을 때 푸른색의 바다, 녹색의 산과 갈색의 흙에 흰색의 구름이 조화를 이루고 있는 아름다운 행성이다.\n" +
            "\n" +
            "지구의 나이는 약 46억 년이라고 알려져 있다. 원시 지구는 태양 주위의 미행성들이 뭉쳐져서탄생한 것으로추측하고 있다. 탄생 직후의 지구는 고온의 마그마 바다였으나 미행성의 충돌이 잠잠해지면서 냉각하기 시작하여 얇은 지각이 형성된다. 이산화탄소가 주성분이었던 원시 대기에 비가 내림으로써 바다가 형성되고, 이산화탄소가 바다에 녹아 하늘이 맑아진다.약 35억 년에서 25억 년 전쯤에는 지표의 온도가 현재 온도와 가까워졌고 지구 환경도 안정기에 접어든다. 그리고 35억 년 전 비로소 지구에 원시 생명이 탄생한다. 이것이 과학자들이 추측하는 지구 탄생의 이야기다." +
            "하늘이 파란 이유는 지구의 대기가 태양 빛 중에서 단파장인 푸른빛을 산란시키기 때문이다. 태양 빛은 여러 파장으로 나눌 수 있는데 그 중 한 부분이 우리가 볼 수 있는 가시광선이다. 가시광선은 빨주노초파남보 색깔로 나뉘게 된다. 빨간색은 상대적으로 파장이 길고, 파란색, 남색, 보라색으로 갈수록 파장이 짧다. 대기는 상대적으로 짧은 푸른색의 빛들을 많이 산란시키게 되고 이에 따라 우리의 눈에는 푸른색이 비쳐 하늘이 파랗게 보이는 것이다.태양이 수평선 방향에 있다면 더욱 많은 대기들을 지나야만 우리 눈에 도달할 수 있는데, 푸른색의 단파장들은 산란되어 여러 방향으로 흩어지고 붉은 계열의 장파장들이 우리의 눈에 도달하기 때문에 저녁 하늘의 노을은 붉고 노란 계열로 보이는 것이다.\n" +
            "\n" +
            "현재 지구의 대기는 약 78%의 질소분자와 21%의 산소분자, 1%의 물 분자, 그리고 미량의 아르곤, 이산화탄소 등으로 이루어져 있다. 대기의 대부분이 이산화탄소로 이루어진금성과는 다른 구성의 대기를 가지게 된 것은금성보다 태양에 멀리 떨어져 있어서 온도가 급상승하지 않았기 때문이다. 따라서 물의 증발에 따른 온실효과의 폭주현상이 일어나지 않았다.대기 중의 이산화탄소는 물에 융해되어 암석에 갇히거나, 식물의광합성 작용으로 인해산소로 바뀌게 되었다. 이로써 현재의 대기분포를 이루게 된 것이다." +
            "지구의 평균온도는 약 290K이며, 수성이나 달처럼 온도 변화가 심하지 않다. 그 이유는 여러 가지가 있겠지만 대기에 의한 효과를 빼놓을 수 없다. 대기는 태양의 빛을 어느 정도 줄여주며, 지표에서 빠져나가는 열을 잡아주기도 한다. 그렇게 하여 낮과 밤의 온도격차를 줄여주어 생명체가 살기 적당한 온도를 유지시켜 준다.\n" +
            "\n" +
            "하지만 산업화가 진행됨에 따라 이산화탄소를 비롯한 온실가스가 인위적으로 지구대기에 방출되고 있고, 이는 지구의 온난화를 초래하고 있다. 대기 중의 온실가스비율이 증가함에 따라 평균온도는 상승하고, 실제로 1970년도부터 평균온도는 지속적으로 상승하고 있다.";
}
